sissoux/eBikeInterface/eBikeInterface.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G4
ProjectManager.MainLocation=Core/Src
NVIC.ADC1_2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ADC2.ExternalTrigConv=ADC_EXTERNALTRIG_T4_TRGO
TIM15.Channel-Input_Capture1_from_TI1=TIM_CHANNEL_1
RCC.USART1Freq_Value=16000000
RCC.SAI1Freq_Value=16000000
RCC.CortexFreq_Value=16000000
TIM1.OCIdleState_1=TIM_OCIDLESTATE_RESET
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G431K8Tx
ADC2.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_1
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:true\:true
TIM1.IPParameters=Channel-PWM Generation1 CH1,Prescaler,PeriodNoDither,OCIdleState_1,OCPolarity_1
SH.COMP_DAC12_group.0=DAC1_OUT2,DAC_OUT2
PA0.GPIO_Label=Temp_in_analog
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC2_Init-ADC2-false-HAL-true,4-MX_DAC1_Init-DAC1-false-HAL-true,5-MX_TIM2_Init-TIM2-false-HAL-true,6-MX_TIM1_Init-TIM1-false-HAL-true,7-MX_TIM4_Init-TIM4-false-HAL-true,8-MX_COMP1_Init-COMP1-false-HAL-true,9-MX_DAC3_Init-DAC3-false-HAL-true,10-MX_TIM6_Init-TIM6-false-HAL-true
DAC1.IPParameters=DAC_Channel-DAC_OUT2,DAC_Trigger_OUT2-DAC_OUT2,DAC_Trigger2_OUT2-DAC_OUT2
COMP1.Hysteresis=COMP_HYSTERESIS_50MV
RCC.USART2Freq_Value=16000000
VP_COMP1_VS_VREFINT14.Signal=COMP1_VS_VREFINT14
SH.S_TIM1_CH1.ConfNb=1
PinOutPanel.RotationAngle=0
TIM4.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
RCC.MCO1PinFreq_Value=16000000
ProjectManager.StackSize=0x400
RCC.I2C3Freq_Value=16000000
RCC.LPTIM1Freq_Value=16000000
Mcu.IP4=NVIC
Mcu.IP5=RCC
RCC.FCLKCortexFreq_Value=16000000
Mcu.IP2=DAC1
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=DAC3
PA15.GPIO_Label=Status_LED
Mcu.IP0=ADC2
Mcu.IP1=COMP1
TIM1.Prescaler=15
Mcu.UserConstants=
PA4.Mode=IN17-Single-Ended
ADC2.DMAContinuousRequests=DISABLE
VP_DAC3_VS_DACI1.Signal=DAC3_VS_DACI1
TIM15.Prescaler=159
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=16000000
TIM2.TIM2_TI2_REMAP-Input_Capture2_from_TI2_Remap_TIM2=TIM_TIM2_TI2_COMP1
Mcu.IPNb=12
TIM2.IPParameters=PeriodNoDither,Prescaler,Channel-Input_Capture2_from_TI2_Remap_TIM2,TIM2_TI2_REMAP-Input_Capture2_from_TI2_Remap_TIM2,ICFilter_CH2
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=16000000
SH.COMP_DAC12_group.ConfNb=1
Mcu.Pin6=PA13
Mcu.Pin7=PA14
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PA15
Mcu.Pin9=VP_COMP1_VS_VREFINT14
ADC2.EOCSelection=ADC_EOC_SINGLE_CONV
RCC.AHBFreq_Value=16000000
Mcu.Pin0=PA0
Mcu.Pin1=PA1
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA2
Mcu.Pin3=PA4
RCC.USART3Freq_Value=16000000
Mcu.Pin4=PA5
Mcu.Pin5=PA8
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
VP_TIM2_VS_NoInput2.Signal=TIM2_VS_NoInput2
PA0.Locked=true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA8.Locked=true
Mcu.IP10=TIM6
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP11=TIM15
VP_DAC3_VS_DACI1.Mode=DAC_OUT1_Int
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.4.0
MxDb.Version=DB.6.0.21
TIM2.PeriodNoDither=32000000
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=16000000
TIM1.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
PA14.Mode=Serial_Wire
NVIC.TIM2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
File.Version=6
PA0.Mode=IN1-Single-Ended
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
PA8.Signal=S_TIM1_CH1
RCC.PLLRCLKFreq_Value=64000000
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
VP_TIM1_VS_ClockSourceINT.Mode=Internal
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=eBikeInterface
PA0.Signal=ADC2_IN1
DAC1.DAC_Trigger2_OUT2-DAC_OUT2=DAC_TRIGGER_NONE
Mcu.Package=LQFP32
TIM2.Prescaler=15
PA5.Locked=true
TIM6.PeriodNoDither=1000
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
PA15.Signal=GPIO_Output
ADC2.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_12CYCLES_5
PA5.GPIOParameters=GPIO_Label
ADC2.NbrOfConversion=1
RCC.PLLPoutputFreq_Value=64000000
VP_TIM2_VS_NoInput2.Mode=Input_Capture2_from_TI2_Remap_TIM2
RCC.APB1TimFreq_Value=16000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=16000000
ADC2.Rank-0\#ChannelRegularConversion=1
ADC2.EnableAnalogWatchDog1=false
PA4.GPIO_Label=Throttle_in_analog
ProjectManager.CustomerFirmwarePackage=
RCC.HSI48_VALUE=48000000
COMP1.TriggerMode=COMP_TRIGGERMODE_NONE
PA2.Locked=true
RCC.I2SFreq_Value=16000000
RCC.PLLQoutputFreq_Value=64000000
TIM1.OCPolarity_1=TIM_OCPOLARITY_HIGH
ProjectManager.ProjectFileName=eBikeInterface.ioc
DAC1.DAC_Trigger_OUT2-DAC_OUT2=DAC_TRIGGER_T4_TRGO
DAC1.DAC_Channel-DAC_OUT2=DAC_CHANNEL_2
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=18
ProjectManager.NoMain=false
TIM4.PeriodNoDither=1000
TIM6.Prescaler=159
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
RCC.FamilyName=M
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
PA13.Signal=SYS_JTMS-SWDIO
VP_COMP1_VS_VREFINT14.Mode=VREFINT_14
PA15.Locked=true
TIM6.IPParameters=Prescaler,PeriodNoDither
SH.S_TIM1_CH1.0=TIM1_CH1,PWM Generation1 CH1
ADC2.ContinuousConvMode=DISABLE
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
ProjectManager.TargetToolchain=STM32CubeIDE
TIM4.IPParameters=Prescaler,PeriodNoDither,TIM_MasterOutputTrigger
ADC2.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,ExternalTrigConv,NbrOfConversion,EOCSelection,ContinuousConvMode,EnableAnalogWatchDog1,DMAContinuousRequests
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
TIM2.ICFilter_CH2=4
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=64000000
TIM4.Prescaler=15
RCC.LSE_VALUE=32768
TIM15.IPParameters=Channel-Input_Capture1_from_TI1,PeriodNoDither,Prescaler,ICFilter_CH1
PA1.Signal=COMP1_INP
TIM15.PeriodNoDither=41000
PA5.Signal=COMP_DAC12_group
ADC2.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
NVIC.TIM1_BRK_TIM15_IRQn=true\:0\:0\:false\:false\:true\:true\:true
board=custom
RCC.VCOOutputFreq_Value=128000000
ProjectManager.LastFirmware=true
SH.S_TIM15_CH1.ConfNb=1
SH.S_TIM15_CH1.0=TIM15_CH1,Input_Capture1_from_TI1
RCC.APB2Freq_Value=16000000
PA1.Mode=INP
RCC.UART4Freq_Value=16000000
COMP1.IPParameters=TriggerMode,Hysteresis
MxCube.Version=6.2.1
RCC.I2C1Freq_Value=16000000
VP_TIM2_VS_ClockSourceINT.Mode=Internal
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
RCC.FDCANFreq_Value=16000000
RCC.RNGFreq_Value=64000000
VP_SYS_VS_Systick.Mode=SysTick
TIM15.ICFilter_CH1=4
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,UART4Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G431K(6-8-B)Tx
PA2.Signal=S_TIM15_CH1
ProjectManager.UnderRoot=true
Mcu.IP8=TIM2
Mcu.IP9=TIM4
Mcu.IP6=SYS
Mcu.IP7=TIM1
ProjectManager.CoupleFile=false
PA4.Signal=ADC2_IN17
RCC.SYSCLKFreq_VALUE=16000000
PA1.Locked=true
PA5.GPIO_Label=Temp_out
ADC2.NbrOfConversionFlag=1
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=VP_TIM2_VS_NoInput2
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=VP_TIM4_VS_ClockSourceINT
Mcu.Pin13=VP_TIM1_VS_ClockSourceINT
Mcu.Pin14=VP_TIM2_VS_ClockSourceINT
ProjectManager.ComputerToolchain=false
Mcu.Pin17=VP_TIM6_VS_ClockSourceINT
RCC.HSI_VALUE=16000000
VP_TIM4_VS_ClockSourceINT.Mode=Internal
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=VP_SYS_VS_Systick
Mcu.Pin12=VP_SYS_VS_DBSignals
Mcu.Pin10=VP_DAC3_VS_DACI1
TIM2.Channel-Input_Capture2_from_TI2_Remap_TIM2=TIM_CHANNEL_2
RCC.PWRFreq_Value=16000000
RCC.I2C2Freq_Value=16000000
RCC.APB1Freq_Value=16000000
ProjectManager.DeviceId=STM32G431K8Tx
ProjectManager.LibraryCopy=1
TIM1.PeriodNoDither=5000
isbadioc=false
